export const getRandomInteger = (a: number, b: number): number => {
    const lower = Math.ceil(Math.min(a, b));
    const upper = Math.floor(Math.max(a, b));
    const result = Math.random() * (upper - lower + 1) + lower;
  
    return Math.floor(result);
  };
  
  const words = [
    "арбуз", "банан", "берег", "бочка", "борец", "валик", "веник", "ветер", "врата", "глина", "гость", "грудь", "грунт",
    "дверь", "завод", "закон", "замок", "излом", "ирбис", "кабан", "кадык", "казак", "канон", "катер", "кисть", "клинч", "ковёр", "конус", "корка", "кофе", "купец", "кузов",
    "ларец", "лазер", "лимон", "локон", "ломик", "лопух", "маска", "мачта", "мелок", "минор", "мотор", "наряд", "носок", "парус", "пашня", "пепел", "певец", "перец", "плата", "поезд", "пятка", "ранец", "ротор", "рукав", "ручей", "сахар", "скала", "склад", "собор", "сосна", "сплав", "ствол", "стена", "стриж", "судно", "сукно", "сусек",
    "табор", "топор", "тунец", "устав", "фокус", "факел", "фонар", "цапля", "цепка", "шалаш", "шапка", "штамп", "эскиз", "якорь"
  ];
  
  export const getTargetWord = (): string => {
    return words[getRandomInteger(0, words.length - 1)];
  };